GTM73/preliminary.tex
% Created 2019-04-09 Tue 11:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{陈小羽}
\date{\today}
\title{Preliminary}
\hypersetup{
 pdfauthor={陈小羽},
 pdftitle={Preliminary},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{logic}
\label{sec:org7eddb79}
\subsection{and}
\label{sec:orge356ec2}
\(\land\)
\subsection{or}
\label{sec:org4e8d350}
\(\lor\)
\subsection{imply}
\label{sec:org06a217a}
\(\to\)
\subsection{iff}
\label{sec:org45bb816}
\(\iff\)
\subsection{not}
\label{sec:org97dbad3}
\(\lnot\)
\subsection{any}
\label{sec:org0be43e4}
\(\forall\)
\subsection{exist}
\label{sec:orgbb5b54f}
\(\exists\)

\section{set and class}
\label{sec:org1ef8275}
\subsection{class}
\label{sec:orgc530900}
a class is a collection \(A\) of objects such that given any object \(x\),
it is possible to determine whether or not \(x\) is a member of \(A\).
\subsection{set}
\label{sec:orgef10192}
a class \(A\) is defined to be a set iff exists a class \(B\) and \(A\in B\).
\subsection{axiom of extensionality}
\label{sec:orgb264a82}
\([x\in A \iff x\in B] \to A = B\)
\subsection{axiom of class formation}
\label{sec:orga05c58e}
for any statements \(P(y)\) in the first-order predicate calculus
involving a variable \(y\), there exists a class \(A\) such that 
\(x\in A\) if and only if \(x\) is a set and the statement \(P(x)\).
we denote this class \(A\) by \(\{x|P(x)\}\).
\subsection{axiom of operation}
\label{sec:org982b54f}
for union, intersection, functions, relations, Cartesian products,
if one of these operation is performed on a set, then the result 
is also a set.
\subsection{power axiom}
\label{sec:org439aa1b}
for all set \(A\), the class \(P(A)\) of all subsets of \(A\) is itself a set.
\(P(A)\) is called the power set of \(A\).
\subsection{subclass}
\label{sec:orgb1ad5e8}
\(A, B\) are classes, then
\(A\subset B \iff (\forall x\in A) x\in A \to x\in B\)
\(A\) is a subclass of \(B\).
if \(B\) is a set, then \(A\) is a subset.
\subsection{empty set}
\label{sec:org8799a62}
\(\emptyset\)
\subsection{family of set}
\label{sec:orgdfa6280}
a family of sets indexed by \(I\) is a collection of sets \(A_i\).
\subsection{disjoint set}
\label{sec:org8dbd230}
\(A\cap B = \emptyset\).

\section{Function}
\label{sec:org6375733}
\subsection{preliminary for funcion}
\label{sec:org5253571}
@page[3]
\subsection{\(f\) and \(g\) injective \(\to\) \(gf\) is injective}
\label{sec:orgd9a5102}
proof: \(x\not=y \to f(x)\not=f(y) \to g(f(x))\not= g(f(y))\)
\subsection{\(f:A\to B\) and \(g:B\to C\) surjective \(\to\) \(gf\) is surjective}
\label{sec:org3a45c18}
proof: \(f(A) = f(B) \to g(f(A)) = g(B) = C\).
\subsection{\(gf\) injective \(\to\) \(f\) is injective}
\label{sec:orgc995b44}
proof: assume \(f\) is not injective, then \((\exists x)(\exists y) f(x) = f(y)\).
so \(g(f(x)) = g(f(y))\). so \(gf\) is not injective, contradiction.
\subsection{\(gf\) surjective \(\to\) \(g\) is surjective}
\label{sec:orga076024}
proof: assume \(g\) is not surjective, then it is easy to see
that \(gf\) is not surjective, contradiction.
\section{Integer}
\label{sec:org4f9c461}
\subsection{Theorem for gcd}
\label{sec:orgdf6d6ac}
If \(a_1, a_2, \cdots, a_n\) are integers, not all \(0\), then \((a_1, a_2, \cdots, a_n)\) exists.
Futhermore, there are integers \(k_1, k_2, \cdots, k_n\) such that:
\[(a_1, a_2, \cdots, a_n) = k_1a_1 + k_2a_2 + \cdots + k_na_n\].
\subsubsection{proof:}
\label{sec:org3edd32a}
Let \(S = \{x_1a_1 + x_2a_2 + \cdots + x_na_n | x_i\in Z, \sum_{i}x_ia_i > 0\}\).
It is easy to see that \(S\not=\emptyset\).
Let \(c = \sum_{i} x_ia_i\) be the least number in \(S\).
We claim that:
\begin{enumerate}
\item \(c | a_i\) for \(1 \leq i \leq n\).
\item \(d\in Z\) and \(d|a_1\) for \(1\leq i\leq n\) \(\to\) \(d|c\).
\end{enumerate}
Then \(c\) is obviously a gcd for \(\{a_i\}\).

\begin{itemize}
\item claim 1: \(c | a_i\) for \(1 \leq i \leq n\).
Assume \(\exists o\) such that \(c\nmid a_o\).
Then, \(\exists q, k\) such that \(a_o = q\sum_{i}x_ia_i + k\).
\(a_o - q\sum_{i}x_ia_i = k > 0\).
\((1-qx_o)a_o + \sum_{i\not=o}x_ia_i = k > 0 \Rightarrow k\in S\).
And because \(k < c\), we get a contradiction. \(\square\)
\item claim 2: \(d\in Z\) and \(d|a_1\) for \(1\leq i\leq n\) \(\to\) \(d|c\).
\(\forall d\) that devided \(\{a_i\}\), we have \(a_i = k_id, i = 1, 2, \cdots, n\).
Then \(c = \sum_{i}x_ia_i = \sum_{i}x_ik_id = d\sum_{i}x_ik_i\).
So \(d | c\). \(\square\)
\end{itemize}
\section{Axiom of choice}
\label{sec:org3779445}
\subsection{axiom of choice}
\label{sec:org03423da}
The product of family of nonempty sets indexed by a nonempty set is nonempty.
\subsection{zorn's lemma}
\label{sec:orgf5dc881}
If \(A\) is a nonempty partially ordered set such that every chain in \(A\) has
upper bound in \(A\), then \(A\) contains a maximal element.
\href{https://en.wikipedia.org/wiki/Zorn\%27s\_lemma}{zorn's lemma wiki}
\subsection{ordinal number}
\label{sec:org0365ea9}
the number of all the ordinal's is more than the number of element in any sets.
\subsubsection{Definition of the ordinal number}
\label{sec:org414d741}
\begin{enumerate}
\item \(\emptyset\)
\item \(\{\emptyset\}\)
\item \(\{\emptyset, \{\emptyset\}\}\)
\item \(\{\emptyset, \{\emptyset\}, \{\emptyset, \{\emptyset\}\}\}\)
\item \(\cdots\)
\end{enumerate}
according to the definition of the ordinal number.
if there is a set \(M\) which contains all the ordinal numbers,
then we have \(M\in M\), this is a paradox for a sets.
I think things like \(M\in M\) may happen on proper class.
\href{https://math.stackexchange.com/questions/1046863/how-can-a-set-contain-itself}{here on stackexchange} is a discussion for this issue.
\subsection{exercise 1 (p14)}
\label{sec:orgeb4f90c}
\begin{itemize}
\item for all subset \(\{a, b\}\subset P(S)\). the g.l.b. is \(a\cap b\).
the l.u.b. is \(a\cup b\). and the unique maximal element is \(S\).
\item \(\{a\leq b, c\leq d\}\). 
the sub set \(\{a, c\}\) do not have lower bound or upper bound.
\item partially set \(\{a\leq b, c\leq d\}\) has no maximal elements.
partially set \(\{a\leq b, c\leq d, a\leq d, c\leq b\}\) has maximal elements \(b, d\).
\end{itemize}
\subsection{exercise 2 (p15)}
\label{sec:org5f3d288}
\(A\) is a complte lattice \(\Rightarrow\) there is a g.l.b. and l.u.b. for \(A\in A\).
from the antisymmetric property of \(A\), we know that \(A\) has 
a unique maximal element and a unique minimal element.
we denote the maximal element of \(A\) by \(m\).
then it is easy to see that \(m = f(m)\).
\subsection{exercise 3 (p15)}
\label{sec:org4d8c99f}
\(\underbrace{\frac{1}{1}}_{2}, \underbrace{\frac{1}{2}, \frac{2}{1}}_{3}, \underbrace{\frac{1}{3}, \frac{2}{2}, \frac{3}{1}}_{4}, \cdots\)
\subsection{exercise 4 (p15)}
\label{sec:org3c1d98b}
we need to prove that:
       the axiom of choice \(\iff\) every set \(S\) has a choice function.
\subsubsection{proof:}
\label{sec:orgb031305}
\(\Rightarrow\): we could construct a product on \(P(S)\setminus \emptyset\).
from axiom of choice, the result of this product is not empty.
So, \(\exists f \in \prod_{A\in S} A\) and we have \(f(A)\in A\).
obviously, \(f\) is the choice function for \(S\).
\(\Leftarrow\): Let \(\{A_i|i\in I\}\) be any family, such that \((\forall i) A_i \not= \emptyset\).
every set \(S\not=\emptyset\) has a choice function \(\Rightarrow\) \((\forall i) A_i\) has a choice function \(f_i\).
from these choice function \(f_i\), we could then construct another function \(\varphi\), 
by defining \(\varphi(i) = f_i(A_i)\). it is quite clear that \(\varphi \in \prod_{i\in I} A_i\), 
which is a nonempty set.
\subsection{exercise 5 (P15)}
\label{sec:orge21f6e8}
\((\forall x\in R) (x, 0)\) is the maximal element in \(S\).
thus, \(S\) has infinitely many maximal elements.
\subsection{exercise 6 (P15)}
\label{sec:org32e27cc}
from exercise 4, we know that \((\forall i) A_i\) has a choice functon \(f\),
mapping all the subsets \(B\) of \(A_i\) to an element in \(B\).
once we have the function \(f\), we could simpliy enumerate \(f(A_i)\) over
all the elements in \(A_i\) \ldots{}
\subsection{exercise 7 (P15)}
\label{sec:orgfe632dc}
There are only 2 cases in which one element \(a\in A\) does not have an
immediate successor:
\begin{enumerate}
\item \(\{x\in A| a < x\} = \emptyset\).
\item \(\{x\in A| a < x\}\) does not have a least element.
\end{enumerate}
\subsubsection{\(A\) is well-ordered}
\label{sec:orgd00653e}
under this condition, only the first case could happen.
assume that we have 2 elements \(a, b\) in \(A\) that has no immediate successor.
however, \(A\) is well-ordered, so there must be a least element in \(\{a, b\}\).
assuming that the least element is \(a\), we will find that the set \(\{x\in A| a < x\}\) is not empty.
which means that \(a\) has a immediate successor in \(A\), which is a contradiction.
\subsubsection{\(A\) is a linearly ordered set}
\label{sec:org1de34f2}
\(\{10, \cdots, -1, 0, 1, 2, 3, 4, 5\}\).
we set that \(10 \leq \cdots \leq -1 \leq 0 \leq 2 \leq 3 \leq 4 \leq 5\).
then, \(10, 5\) are 2 elements with no immediate successor.
\section{Cardinal numbers}
\label{sec:orgcf97329}
\subsection{If \(A\) is a set and \(P(A)\) its power set, then \(|A| < |P(A)|\)}
\label{sec:org3391ee6}
\subsubsection{proof}
\label{sec:org799dce4}
to finish the proof, we claim that:
\begin{enumerate}
\item \(|A| \leq |P(A)|\)
\item \(|A| \not= |P(A)|\)
\end{enumerate}
we prove them one by one.
\begin{enumerate}
\item \(|A| \leq |P(A)|\):
define a map \(f: A\to P(A)\) as \(a\mapsto \{a\}\).
this map is obviously a injection. so \(|A| \leq |P(A)|\).
\item \(|A| \not= |P(A)|\):
to prove this, we only need to prove that:
\([(\forall) f: A\to P(A)] \to f \mbox{is not surjective}\).
for any function \(f\), we define a set \(B = \{a\in A | a\not\in f(a)\}\).
it is easy to see that by definition, \(B\subset A\).
so, if \(f\) is surjective, then \((\exists) x\in A \land x\mapsto B\).
then we could get \(x\in B \land x\not\in B\), which is a contradiction.
\end{enumerate}
\subsection{ordered by extension (p18)}
\label{sec:orgf7ee672}
\subsection{Exercise 1 (P21)}
\label{sec:org41bd786}
\begin{enumerate}
\item (a) omit
\item (b) (a) \(\Rightarrow\) (b)
\item (c) omit
\end{enumerate}
\subsection{Exercise 2 (P21)}
\label{sec:org3ed6dfc}
\begin{enumerate}
\item Assume that we have a infinit set \(A = \{a_0, a_1, a_2, \cdots \}\).
Then we could build a bijection \(f: A\to A-\{a_0\}\) by setting \(f(a_i) = a_{i+1}, i\in N\).
It is easy to see that \(A-\{a_0\}\subset A\).
\item \(\Leftarrow\): could be easily got from (1).
\(\Rightarrow\): could be got from 1.(1).
\end{enumerate}
\subsection{Exercise 3 (P21)}
\label{sec:org293f115}
\begin{enumerate}
\item we could build a bijection \(f: Z\to N\) by setting:
\begin{displaymath}
  f(x) = \left\{
  \begin{array}{lr}
      0, &x = 0 \\
      -x*2, &x < 0 \\
      x*2+1, &x > 0
  \end{array}
  \right. 
\end{displaymath}
\item omit.
\end{enumerate}
\subsection{Exercise 4, 5, 6, 7, 8 (P21)}
\label{sec:org8a60275}
omit.
\subsection{Exercise 9 (P21)}
\label{sec:orgd3af2dc}
\end{document}